uhnp/src/InformationRegisters/НастройкиАдресныхСкладов/НастройкиАдресныхСкладов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиАдресныхСкладов</name>
  <resources>
    <name>ГлубинаАнализа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МинимальнаяВероятностьОтгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УровеньОбслуживанияУпаковокКлассаX</name>
    <type>
      <types>EnumRef.УровниОбслуживания</types>
    </type>
  </resources>
  <resources>
    <name>УровеньОбслуживанияУпаковокКлассаY</name>
    <type>
      <types>EnumRef.УровниОбслуживания</types>
    </type>
  </resources>
  <resources>
    <name>УровеньОбслуживанияУпаковокКлассаZ</name>
    <type>
      <types>EnumRef.УровниОбслуживания</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьПрогнозРасходаУпаковок</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РегламентноеЗаданиеРасчетаПоказателейПрогноза</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьАдресноеХранение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьАдресноеХранениеСправочно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьРабочиеУчастки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РегламентноеЗаданиеСозданиеЗаданийНаОтбор</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьРегламентноеЗаданиеСозданияЗаданийНаОтбор</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НастройкаФормированияПоРабочимУчасткамОтбор</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ОграничиватьПоВесуОтбор</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОграничиватьПоОбъемуОтбор</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОграничениеПоОбъемуОтбор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОграничениеПоВесуОтбор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РабочийУчастокОтбор</name>
    <type>
      <types>CatalogRef.РабочиеУчастки</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаАдресногоХраненияОстатков</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>РегламентныеЗаданияСозданияЗаданийНаПересчетТоваров</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>РегламентныеЗаданияСозданияЗаданийНаПеремещение</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.СкладскиеПомещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/НастройкиАдресныхСкладов/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Для Каждого СтрМас Из ЭтотОбъект Цикл
		СтрМас.ГлубинаАнализа                     = Метаданные.РегистрыСведений.НастройкиАдресныхСкладов.Ресурсы.ГлубинаАнализа.ЗначениеЗаполнения;
		СтрМас.МинимальнаяВероятностьОтгрузки     = Метаданные.РегистрыСведений.НастройкиАдресныхСкладов.Ресурсы.МинимальнаяВероятностьОтгрузки.ЗначениеЗаполнения;
		СтрМас.УровеньОбслуживанияУпаковокКлассаX = Метаданные.РегистрыСведений.НастройкиАдресныхСкладов.Ресурсы.УровеньОбслуживанияУпаковокКлассаX.ЗначениеЗаполнения;
		СтрМас.УровеньОбслуживанияУпаковокКлассаZ = Метаданные.РегистрыСведений.НастройкиАдресныхСкладов.Ресурсы.УровеньОбслуживанияУпаковокКлассаZ.ЗначениеЗаполнения;
		СтрМас.ИспользоватьПрогнозРасходаУпаковок = Метаданные.РегистрыСведений.НастройкиАдресныхСкладов.Ресурсы.ИспользоватьПрогнозРасходаУпаковок.ЗначениеЗаполнения;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	ТекущийОбъект = ЭтотОбъект[0];
	
	МассивНепроверяемыхРеквизитов.Добавить("РабочийУчастокОтбор");
	МассивНепроверяемыхРеквизитов.Добавить("ОграничениеПоВесуОтбор");
	МассивНепроверяемыхРеквизитов.Добавить("ОграничениеПоОбъемуОтбор");
			
	Если ТекущийОбъект.НастройкаФормированияПоРабочимУчасткамОтбор = "ПоОдномуРабочемуУчастку" 
		И Не ЗначениеЗаполнено(ТекущийОбъект.РабочийУчастокОтбор) Тогда
		
		ТекстСообщения = НСтр("ru = 'Поле ""Рабочий участок"" для создания заданий на отбор не заполнено.';
								|en = '""Warehouse area"" field used to create filter jobs is not filled in.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "РабочийУчастокОтбор", "Запись", Отказ);
		
	КонецЕсли;
	
	Если ТекущийОбъект.ОграничиватьПоВесуОтбор
		И Не ЗначениеЗаполнено(ТекущийОбъект.ОграничениеПоВесуОтбор)
		И (Не ТекущийОбъект.НастройкаФормированияПоРабочимУчасткамОтбор = "СРазбиениемПоРабочимУчасткам") Тогда
		
		ТекстСообщения = НСтр("ru = 'Поле ""Ограничение по весу"" для создания заданий на отбор не заполнено.';
								|en = '""Weight limit"" field used to create filter jobs is not filled in.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ОграничениеПоВесу", "Запись", Отказ);
		
	КонецЕсли;
	
	Если ТекущийОбъект.ОграничиватьПоОбъемуОтбор
		И Не ЗначениеЗаполнено(ТекущийОбъект.ОграничениеПоОбъемуОтбор)
		И (Не ТекущийОбъект.НастройкаФормированияПоРабочимУчасткамОтбор = "СРазбиениемПоРабочимУчасткам") Тогда
		
		ТекстСообщения = НСтр("ru = 'Поле ""Ограничение по объему"" для создания заданий на отбор не заполнено.';
								|en = '""Limitation on volume"" field used to create filter jobs is not filled in.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ОграничениеПоОбъему", "Запись", Отказ);
		
	КонецЕсли;
	
 	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры
	
#КонецОбласти
#КонецЕсли
